espressif/arduino-esp32/libraries/WiFi/src/WiFiGeneric.cpp
static bool initWiFiEvents(){
    if(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb, NULL, NULL)){
        log_e("event_handler_instance_register for WIFI_EVENT Failed!");
        return false;
    }

    // if(esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb, NULL, NULL)){
    //     log_e("event_handler_instance_register for IP_EVENT Failed!");
    //     return false;
    // }

    if(esp_event_handler_instance_register(SC_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb, NULL, NULL)){
        log_e("event_handler_instance_register for SC_EVENT Failed!");
        return false;
    }

    if(esp_event_handler_instance_register(WIFI_PROV_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb, NULL, NULL)){
        log_e("event_handler_instance_register for WIFI_PROV_EVENT Failed!");
        return false;
    }

    return true;
}

static bool deinitWiFiEvents(){
    if(esp_event_handler_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb)){
        log_e("esp_event_handler_unregister for WIFI_EVENT Failed!");
        return false;
    }

    // if(esp_event_handler_unregister(IP_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb)){
    //     log_e("esp_event_handler_unregister for IP_EVENT Failed!");
    //     return false;
    // }

    if(esp_event_handler_unregister(SC_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb)){
        log_e("esp_event_handler_unregister for SC_EVENT Failed!");
        return false;
    }

    if(esp_event_handler_unregister(WIFI_PROV_EVENT, ESP_EVENT_ANY_ID, &_arduino_event_cb)){
        log_e("esp_event_handler_unregister for WIFI_PROV_EVENT Failed!");
        return false;
    }

    return true;
}

/*
 * WiFi INIT
 * */

static bool lowLevelInitDone = false;
bool WiFiGenericClass::_wifiUseStaticBuffers = false;

bool WiFiGenericClass::useStaticBuffers(){
    return _wifiUseStaticBuffers;
}

void WiFiGenericClass::useStaticBuffers(bool bufferMode){
    if (lowLevelInitDone) {
        log_w("WiFi already started. Call WiFi.mode(WIFI_MODE_NULL) before setting Static Buffer Mode.");
    } 
    _wifiUseStaticBuffers = bufferMode;
}

// Temporary fix to ensure that CDC+JTAG stay on on ESP32-C3
#if CONFIG_IDF_TARGET_ESP32C3
extern "C" void phy_bbpll_en_usb(bool en);
#endif

bool wifiLowLevelInit(bool persistent){
    if(!lowLevelInitDone){
        lowLevelInitDone = true;
        if(!Network.begin()){
        	lowLevelInitDone = false;
        	return lowLevelInitDone;
        }

        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();

        if(!WiFiGenericClass::useStaticBuffers()) {
            cfg.static_tx_buf_num = 0;
            cfg.dynamic_tx_buf_num = 32;
            cfg.tx_buf_type = 1;
            cfg.cache_tx_buf_num = 4;  // can't be zero!
            cfg.static_rx_buf_num = 4;
            cfg.dynamic_rx_buf_num = 32;
        }

        esp_err_t err = esp_wifi_init(&cfg);
        if(err){
            log_e("esp_wifi_init %d", err);
        	lowLevelInitDone = false;
        	return lowLevelInitDone;
        }
// Temporary fix to ensure that CDC+JTAG stay on on ESP32-C3
#if CONFIG_IDF_TARGET_ESP32C3
        phy_bbpll_en_usb(true);
#endif
        if(!persistent){
        	lowLevelInitDone = esp_wifi_set_storage(WIFI_STORAGE_RAM) == ESP_OK;
        }
        if(lowLevelInitDone){
            initWiFiEvents();
            if(esp_netifs[ESP_IF_WIFI_AP] == NULL){
                esp_netifs[ESP_IF_WIFI_AP] = esp_netif_create_default_wifi_ap();
            }
            if(esp_netifs[ESP_IF_WIFI_STA] == NULL){
                esp_netifs[ESP_IF_WIFI_STA] = esp_netif_create_default_wifi_sta();
            }

			arduino_event_t arduino_event;
			arduino_event.event_id = ARDUINO_EVENT_WIFI_READY;
			Network.postEvent(&arduino_event);
        }
    }
    return lowLevelInitDone;
}

static bool wifiLowLevelDeinit(){
    if(lowLevelInitDone){
        lowLevelInitDone = false;
        deinitWiFiEvents();
        if(esp_netifs[ESP_IF_WIFI_AP] != NULL){
            esp_netif_destroy_default_wifi(esp_netifs[ESP_IF_WIFI_AP]);
            esp_netifs[ESP_IF_WIFI_AP] = NULL;
        }
        if(esp_netifs[ESP_IF_WIFI_STA] != NULL){
            esp_netif_destroy_default_wifi(esp_netifs[ESP_IF_WIFI_STA]);
            esp_netifs[ESP_IF_WIFI_STA] = NULL;
        }
    	lowLevelInitDone = !(esp_wifi_deinit() == ESP_OK);
        if(!lowLevelInitDone){
            arduino_event_t arduino_event;
            arduino_event.event_id = ARDUINO_EVENT_WIFI_OFF;
            Network.postEvent(&arduino_event);
        }
    }
    return !lowLevelInitDone;
}

static bool _esp_wifi_started = false;

static bool espWiFiStart(){
    if(_esp_wifi_started){
        return true;
    }
    _esp_wifi_started = true;
    esp_err_t err = esp_wifi_start();
    if (err != ESP_OK) {
        _esp_wifi_started = false;
        log_e("esp_wifi_start %d", err);
        return _esp_wifi_started;
    }
    return _esp_wifi_started;
}

static bool espWiFiStop(){
    esp_err_t err;
    if(!_esp_wifi_started){
        return true;
    }
    _esp_wifi_started = false;
    err = esp_wifi_stop();
    if(err){
        log_e("Could not stop WiFi! %d", err);
        _esp_wifi_started = true;
        return false;
    }
    return wifiLowLevelDeinit();
}

// -----------------------------------------------------------------------------------------------------------------------
// ------------------------------------------------- Generic WiFi function -----------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

bool WiFiGenericClass::_persistent = true;
bool WiFiGenericClass::_long_range = false;
wifi_mode_t WiFiGenericClass::_forceSleepLastMode = WIFI_MODE_NULL;
#if CONFIG_IDF_TARGET_ESP32S2
wifi_ps_type_t WiFiGenericClass::_sleepEnabled = WIFI_PS_NONE;
#else
wifi_ps_type_t WiFiGenericClass::_sleepEnabled = WIFI_PS_MIN_MODEM;
#endif

WiFiGenericClass::WiFiGenericClass() 
{
}

